In [2]:
import pandas as pd

In [2]:
s=pd.Series(data=[1,2,3,4])

In [3]:
s

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
s=pd.Series(data=[1,2,3,4],index=["D1","D2","D3","D4"])

In [5]:
s

D1    1
D2    2
D3    3
D4    4
dtype: int64

In [6]:
type(s)

pandas.core.series.Series

In [7]:
data=pd.DataFrame()

In [8]:
print(data)

Empty DataFrame
Columns: []
Index: []

In [9]:
data=pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12]])

In [10]:
data

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [11]:
data=pd.DataFrame([["Abhishek",23],["Mahesh",24],["Sunil",25]],columns=["Name","Age"],index=["Data 1","Data 2","Data 3"])

In [12]:
data

            Name  Age
Data 1  Abhishek   23
Data 2    Mahesh   24
Data 3     Sunil   25

In [13]:
data1=pd.DataFrame({"Name":["Abhishek","Abhishek","Mahesh","Sunil","Ravi","Rohit"],"Age":[23,24,25,23,24,25]},index=["Data 1","Data 2","Data 3","Data 4","Data 5","Data 6"])

In [84]:
data1

            Name  Age
Data 1  Abhishek   23
Data 2  Abhishek   24
Data 3    Mahesh   25
Data 4     Sunil   23
Data 5      Ravi   24
Data 6     Rohit   25

In [85]:
data1["Name"]

Data 1    Abhishek
Data 2    Abhishek
Data 3      Mahesh
Data 4       Sunil
Data 5        Ravi
Data 6       Rohit
Name: Name, dtype: object

In [86]:
data1["Name"][0]

'Abhishek'

In [73]:
data1

            Name  Age
Data 1  Abhishek   23
Data 2    Mahesh   24
Data 3     Sunil   25

In [72]:
data1.iloc[:,1]#iloc[rows,columns] index based location

Data 1    23
Data 2    24
Data 3    25
Name: Age, dtype: int64

In [74]:
data1.iloc[1,:]

Name    Mahesh
Age         24
Name: Data 2, dtype: object

In [75]:
data1.iloc[2,1]

25

In [76]:
data1.iloc[0:2,1]

Data 1    23
Data 2    24
Name: Age, dtype: int64

In [105]:
data1[(data1["Age"]>24)]

          Name  Age
Data 3  Mahesh   25
Data 6   Rohit   25

# Read the csv files

In [3]:
data=pd.read_csv(r"F:\Data\Data.csv")#Read csv file in the form of pandas datafraame

In [61]:
type(data)

pandas.core.frame.DataFrame

In [17]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [18]:
data["Country"]

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

In [19]:
data.iloc[:,0]

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

In [20]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [21]:
data.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [22]:
data.head(7)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No

In [27]:
data.tail()

   Country   Age   Salary Purchased
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [28]:
data.shape# Rows,columns

(10, 4)

In [30]:
data.shape[1]

4

In [32]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [36]:
data.dtypes # Data Type of all columns

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object

In [38]:
data["Age"].dtypes #Data type of particualr column

dtype('float64')

In [40]:
data.info() #Information about dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
Country      10 non-null object
Age          9 non-null float64
Salary       9 non-null float64
Purchased    10 non-null object
dtypes: float64(2), object(2)
memory usage: 448.0+ bytes

In [42]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [43]:
data.isnull()

   Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False

In [4]:
data.isnull().any()#True -missing value is present, #Flase missing value is not present

Country      False
Age           True
Salary        True
Purchased    False
dtype: bool

In [45]:
data.isnull().sum()#no of missing values in a column

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [46]:
data.describe()#stats info

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [47]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [11]:
data.drop(0,axis=0)#row wise

   Country   Age   Salary Purchased
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [65]:
data.drop("Country",axis=1,inplace=True)#column

In [68]:
data

    Age   Salary Purchased
0  44.0  72000.0        No
1  27.0  48000.0       Yes
2  30.0  54000.0        No
3  38.0  61000.0        No
4  40.0      NaN       Yes
5  35.0  58000.0       Yes
6   NaN  52000.0        No
7  48.0  79000.0       Yes
8  50.0  83000.0        No
9  37.0  67000.0       Yes

In [71]:
data.loc[0,"Salary"] #loc[row,columns]

72000.0

In [77]:
data.loc[data["Purchased"]=="Yes"]

    Age   Salary Purchased
1  27.0  48000.0       Yes
4  40.0      NaN       Yes
5  35.0  58000.0       Yes
7  48.0  79000.0       Yes
9  37.0  67000.0       Yes

In [19]:
data.isnull().any(axis=1)

0    False
1    False
2    False
3    False
4     True
5    False
6     True
7    False
8    False
9    False
dtype: bool

In [16]:
data.isnull().any(axis=0)

Country      False
Age           True
Salary        True
Purchased    False
dtype: bool